benchmark/wrk2/map-t1-c1.txt
Running 5s test @ http://127.0.0.1:8091/v1/search/map/prices
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.66ms    5.39ms  33.15ms   92.03%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.97ms
 75.000%    7.88ms
 90.000%    9.26ms
 99.000%   28.77ms
 99.900%   33.15ms
 99.990%   33.18ms
 99.999%   33.18ms
100.000%   33.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.314     0.000000            1         1.00
       0.781     0.100000         1002         1.11
       1.206     0.200000         1998         1.25
       1.655     0.300000         2999         1.43
       3.327     0.400000         3997         1.67
       4.975     0.500000         4996         2.00
       5.751     0.550000         5497         2.22
       6.427     0.600000         5997         2.50
       7.003     0.650000         6502         2.86
       7.483     0.700000         6994         3.33
       7.883     0.750000         7496         4.00
       8.071     0.775000         7752         4.44
       8.199     0.800000         7993         5.00
       8.327     0.825000         8249         5.71
       8.511     0.850000         8505         6.67
       8.759     0.875000         8751         8.00
       8.951     0.887500         8873         8.89
       9.255     0.900000         8996        10.00
      10.247     0.912500         9116        11.43
      11.967     0.925000         9241        13.33
      14.127     0.937500         9366        16.00
      14.975     0.943750         9431        17.78
      15.959     0.950000         9491        20.00
      17.919     0.956250         9553        22.86
      19.631     0.962500         9616        26.67
      20.831     0.968750         9680        32.00
      21.823     0.971875         9710        35.56
      22.911     0.975000         9741        40.00
      23.775     0.978125         9772        45.71
      24.271     0.981250         9803        53.33
      26.127     0.984375         9834        64.00
      27.023     0.985938         9850        71.11
      27.839     0.987500         9866        80.00
      28.431     0.989062         9881        91.43
      28.927     0.990625         9897       106.67
      29.247     0.992188         9914       128.00
      29.263     0.992969         9922       142.22
      29.919     0.993750         9928       160.00
      30.703     0.994531         9936       182.86
      31.359     0.995313         9944       213.33
      31.839     0.996094         9951       256.00
      32.047     0.996484         9955       284.44
      32.319     0.996875         9959       320.00
      32.495     0.997266         9963       365.71
      32.623     0.997656         9967       426.67
      32.767     0.998047         9971       512.00
      32.863     0.998242         9973       568.89
      32.959     0.998437         9975       640.00
      33.023     0.998633         9977       731.43
      33.119     0.998828         9979       853.33
      33.151     0.999023         9985      1024.00
      33.151     0.999121         9985      1137.78
      33.151     0.999219         9985      1280.00
      33.151     0.999316         9985      1462.86
      33.151     0.999414         9985      1706.67
      33.183     0.999512         9990      2048.00
      33.183     1.000000         9990          inf
#[Mean    =        5.661, StdDeviation   =        5.386]
#[Max     =       33.152, Total count    =         9990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9991 requests in 5.00s, 1.94MB read
Requests/sec:   1998.76
Transfer/sec:    398.19KB