benchmark/wrk2/map-t2-c20-R100.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 3.158ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.112ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.17ms    1.01ms   8.45ms   65.91%
    Req/Sec    52.50     91.18   333.00     79.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.99ms
 75.000%    4.01ms
 90.000%    4.40ms
 99.000%    5.41ms
 99.900%    7.32ms
 99.990%    8.45ms
 99.999%    8.45ms
100.000%    8.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.465     0.000000            1         1.00
       2.027     0.100000          198         1.11
       2.267     0.200000          396         1.25
       2.475     0.300000          595         1.43
       2.695     0.400000          792         1.67
       2.989     0.500000          990         2.00
       3.425     0.550000         1089         2.22
       3.631     0.600000         1188         2.50
       3.783     0.650000         1287         2.86
       3.907     0.700000         1386         3.33
       4.009     0.750000         1487         4.00
       4.053     0.775000         1537         4.44
       4.111     0.800000         1586         5.00
       4.195     0.825000         1634         5.71
       4.247     0.850000         1683         6.67
       4.327     0.875000         1733         8.00
       4.367     0.887500         1760         8.89
       4.399     0.900000         1783        10.00
       4.443     0.912500         1809        11.43
       4.475     0.925000         1832        13.33
       4.519     0.937500         1859        16.00
       4.539     0.943750         1869        17.78
       4.579     0.950000         1881        20.00
       4.631     0.956250         1898        22.86
       4.663     0.962500         1906        26.67
       4.719     0.968750         1919        32.00
       4.767     0.971875         1925        35.56
       4.783     0.975000         1931        40.00
       4.843     0.978125         1937        45.71
       4.963     0.981250         1943        53.33
       5.147     0.984375         1950        64.00
       5.175     0.985938         1953        71.11
       5.247     0.987500         1956        80.00
       5.407     0.989062         1959        91.43
       5.579     0.990625         1962       106.67
       5.687     0.992188         1965       128.00
       5.703     0.992969         1967       142.22
       5.755     0.993750         1968       160.00
       5.971     0.994531         1970       182.86
       6.155     0.995313         1971       213.33
       6.283     0.996094         1973       256.00
       6.443     0.996484         1974       284.44
       6.443     0.996875         1974       320.00
       6.515     0.997266         1975       365.71
       6.735     0.997656         1976       426.67
       6.811     0.998047         1977       512.00
       6.811     0.998242         1977       568.89
       6.811     0.998437         1977       640.00
       7.323     0.998633         1978       731.43
       7.323     0.998828         1978       853.33
       7.651     0.999023         1979      1024.00
       7.651     0.999121         1979      1137.78
       7.651     0.999219         1979      1280.00
       7.651     0.999316         1979      1462.86
       7.651     0.999414         1979      1706.67
       8.455     0.999512         1980      2048.00
       8.455     1.000000         1980          inf
#[Mean    =        3.174, StdDeviation   =        1.005]
#[Max     =        8.448, Total count    =         1980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3002 requests in 30.00s, 598.05KB read
Requests/sec:    100.05
Transfer/sec:     19.93KB