benchmark/wrk2/map-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 2.966ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.982ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.79ms    2.65ms  29.52ms   87.92%
    Req/Sec     1.04k   245.80     2.50k    76.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85ms
 75.000%    3.04ms
 90.000%    6.09ms
 99.000%   13.65ms
 99.900%   20.08ms
 99.990%   23.53ms
 99.999%   29.53ms
100.000%   29.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.354     0.000000            1         1.00
       0.920     0.100000         3993         1.11
       1.179     0.200000         7986         1.25
       1.400     0.300000        11974         1.43
       1.618     0.400000        15962         1.67
       1.850     0.500000        19950         2.00
       1.988     0.550000        21951         2.22
       2.151     0.600000        23950         2.50
       2.345     0.650000        25933         2.86
       2.621     0.700000        27940         3.33
       3.037     0.750000        29924         4.00
       3.341     0.775000        30921         4.44
       3.729     0.800000        31917         5.00
       4.179     0.825000        32920         5.71
       4.747     0.850000        33913         6.67
       5.351     0.875000        34911         8.00
       5.703     0.887500        35407         8.89
       6.087     0.900000        35906        10.00
       6.519     0.912500        36407        11.43
       7.019     0.925000        36904        13.33
       7.607     0.937500        37404        16.00
       7.975     0.943750        37654        17.78
       8.383     0.950000        37902        20.00
       8.839     0.956250        38150        22.86
       9.351     0.962500        38401        26.67
      10.007     0.968750        38654        32.00
      10.415     0.971875        38775        35.56
      10.815     0.975000        38898        40.00
      11.239     0.978125        39023        45.71
      11.759     0.981250        39148        53.33
      12.311     0.984375        39274        64.00
      12.607     0.985938        39335        71.11
      12.999     0.987500        39397        80.00
      13.407     0.989062        39460        91.43
      13.791     0.990625        39521       106.67
      14.295     0.992188        39584       128.00
      14.575     0.992969        39616       142.22
      14.935     0.993750        39646       160.00
      15.279     0.994531        39678       182.86
      15.671     0.995313        39708       213.33
      16.215     0.996094        39740       256.00
      16.559     0.996484        39755       284.44
      17.007     0.996875        39771       320.00
      17.487     0.997266        39786       365.71
      18.111     0.997656        39802       426.67
      18.607     0.998047        39818       512.00
      18.799     0.998242        39825       568.89
      19.295     0.998437        39833       640.00
      19.583     0.998633        39842       731.43
      19.855     0.998828        39849       853.33
      20.159     0.999023        39857      1024.00
      20.367     0.999121        39861      1137.78
      20.591     0.999219        39865      1280.00
      20.767     0.999316        39868      1462.86
      21.247     0.999414        39872      1706.67
      21.567     0.999512        39876      2048.00
      21.695     0.999561        39878      2275.56
      21.903     0.999609        39880      2560.00
      22.239     0.999658        39882      2925.71
      22.431     0.999707        39884      3413.33
      22.703     0.999756        39886      4096.00
      22.767     0.999780        39887      4551.11
      22.847     0.999805        39888      5120.00
      23.071     0.999829        39889      5851.43
      23.183     0.999854        39890      6826.67
      23.535     0.999878        39891      8192.00
      23.535     0.999890        39891      9102.22
      24.143     0.999902        39892     10240.00
      24.143     0.999915        39892     11702.86
      24.255     0.999927        39893     13653.33
      24.255     0.999939        39893     16384.00
      24.255     0.999945        39893     18204.44
      24.879     0.999951        39894     20480.00
      24.879     0.999957        39894     23405.71
      24.879     0.999963        39894     27306.67
      24.879     0.999969        39894     32768.00
      24.879     0.999973        39894     36408.89
      29.535     0.999976        39895     40960.00
      29.535     1.000000        39895          inf
#[Mean    =        2.790, StdDeviation   =        2.653]
#[Max     =       29.520, Total count    =        39895]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59958 requests in 30.00s, 11.66MB read
Requests/sec:   1998.59
Transfer/sec:    398.16KB